Revit 2027 API
StructuralSectionConcreteI.TopFlangeWidth Property
 Top Flange Width.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TopFlangeWidth { get; set; }
Public Property TopFlangeWidth As Double
	Get
	Set
public:
property double TopFlangeWidth {
	double get ();
	void set (double value);
}
member TopFlangeWidth : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionConcreteI Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace